export const campaignStatus = [
  { id: 'notScheduled', name: 'ഷെഡ്യൂൾ ചെയ്തിട്ടില്ല' },
  { id: 'scheduled', name: 'ഷെഡ്യൂൾ ചെയ്തു' },
  { id: 'completed', name: 'സന്ദർശനം കഴിഞ്ഞു' },
];

export const actionChoices = [
  { id: '1', name: 'പീസ് റേഡിയോ ഇൻസ്റ്റാൾ ചെയ്തു' },
  { id: '2', name: 'നേർപഥം പരിചയപ്പെടുത്തി' },
  { id: '3', name: 'ഖുർആൻ ക്‌ളാസിനു  ക്ഷണിച്ചു' },
  { id: '4', name: 'ലഖുലേഖകൾ കൈമാറി' },
  { id: '5', name: 'ഇസ്ലാമിക പുസ്തകങ്ങൾ കൈമാറി' },
]

export const occupationChoices = [
  { id: 0, name: 'കച്ചവടം' },
  { id: 1, name: 'ഡ്രൈവർ' },
  { id: 2, name: 'അധ്യാപകൻ' },
  { id: 3, name: 'ഗവ: ജീവനക്കാരൻ' },
  { id: 4, name: 'ഡോക്ടർ' },
  { id: 5, name: 'എഞ്ചിനീയർ' },
  { id: 5, name: 'വിദ്യാർത്ഥി' },
  { id: 5, name: 'രാഷ്ട്രീയം' },
  { id: 5, name: 'ഐടി/സോഫ്റ്റ്‌വെയർ' },
  { id: 5, name: 'മീഡിയാ/ജേർണലിസ്റ്റ്' },
  { id: 5, name: 'നിയമം/കോടതി' },
  { id: 5, name: 'പോലീസ് ഉദ്യോഗം' },
  { id: 5, name: 'നഴ്സിങ്' },
  { id: 5, name: 'പ്രവാസി' },
  { id: 5, name: 'മറ്റുള്ളവ' },
];


export const guestTypes = [
  { id: 1, name: 'നിക്ഷ്പക്ഷൻ' },
  { id: 2, name: 'വിസ്‌ഡം അനുഭാവി' },
  { id: 3, name: 'മുജാഹിദ് (KNM)' },
  { id: 4, name: 'മുജാഹിദ് (മടവൂർ)' },
  { id: 5, name: 'മുജാഹിദ് (KNM) അനുഭാവി' },
  { id: 6, name: 'മുജാഹിദ് (മങ്കട/സകരിയ)' },
  { id: 7, name: 'ജമാത്തെ ഇസ്ലാമി' },
  { id: 8, name: 'തബ്‌ലീഗ് ജമാഅത്ത്' },
  { id: 9, name: 'സമസ്ത (AP)' },
  { id: 10, name: 'സമസ്ത (EK)' },
  { id: 11, name: 'സമസ്ത അനുഭാവി' },
  { id: 12, name: 'ഖാദിയാനി' },
  { id: 13, name: 'നിരീശ്വരവാദി' },
];

export const responseChoices = [
  { id: '0', name: 'കൂടുതൽ നമ്മുടെ മെറ്റീരിയൽസ് ആവശ്യമുണ്ട്' },
  { id: '1', name: 'നേർപഥം വരിചേർന്നു' },
  { id:' 2', name: 'ഇസ്ലാമിക ദഅവക്ക് താല്പര്യമുണ്ട്' },
  { id: '3', name: 'ഖുർആൻ ട്രാൻസ്ലേഷൻ ആവശ്യമുണ്ട്' },
  { id:' 4', name: 'സാമ്പത്തിക പ്രതിസന്ധി/രോഗം വെൽഫെയർ ആവശ്യമാണ്' },
  { id: '5', name: 'കൗൺസിലിംഗ് ആവശ്യമുണ്ട്' },
  { id:' 6', name: 'സംസാരിക്കാൻ കൂട്ടാക്കിയില്ല' },
  { id:' 7', name: 'വിമർശനാത്മകമായ സമീപനം' },
];


export const nextActionChoices = [
  { id: 0, name: 'വീണ്ടും സന്ദർശിക്കുക' },
];
